In [1]:
import pandas as pd
import numpy as np

In [22]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)
s4=np.random.randint(10,size=5)

In [23]:
sozluk={"var1":s1,"var2":s2,"var3":s3,"var4":s4}
sozluk

{'var1': array([3, 1, 8, 1, 8]),
 'var2': array([9, 1, 0, 3, 8]),
 'var3': array([7, 5, 4, 5, 8]),
 'var4': array([6, 1, 3, 9, 6])}

In [24]:
df=pd.DataFrame(sozluk,index=["a","b","c","d","e"])

In [25]:
df

   var1  var2  var3  var4
a     3     9     7     6
b     1     1     5     1
c     8     0     4     3
d     1     3     5     9
e     8     8     8     6

In [13]:
df.drop("a",axis=0)

   var1  var2  var3  var4
b     6     5     7     8
c     9     4     9     6
d     6     4     7     6
e     9     8     1     2

In [26]:
df

   var1  var2  var3  var4
a     3     9     7     6
b     1     1     5     1
c     8     0     4     3
d     1     3     5     9
e     8     8     8     6

In [32]:
df.iloc[1:3]["var3"]

b    5
c    4
Name: var3, dtype: int32

In [34]:
df>3

    var1   var2  var3   var4
a  False   True  True   True
b  False  False  True  False
c   True  False  True  False
d  False  False  True   True
e   True   True  True   True

In [38]:
df.var1.mean()

4.2

In [42]:
df["a",axis=0].mean()

SyntaxError: invalid syntax (<ipython-input-42-7e113163aa5d>, line 1)

In [43]:
df

   var1  var2  var3  var4
a     3     9     7     6
b     1     1     5     1
c     8     0     4     3
d     1     3     5     9
e     8     8     8     6

In [44]:
df.T

      a  b  c  d  e
var1  3  1  8  1  8
var2  9  1  0  3  8
var3  7  5  4  5  8
var4  6  1  3  9  6